# ქეის სენსეტიურ პროგრამირების ენაში ლოვერქეისიანი და აპერქეისიანი 2 სხვადასხვა ცვლადლად შეინახება (იგივეა ბრძანებებზეც)
# ქეის ინსენსეტიურში კი პირიქითაა

#case sensetive: python,javascript,c++
#case insensetive: html,SQL, pascal.

#პლიუსით განახლება: += 
#მინუსით განახლება: -=
#გაყოფით განახლება: /=
#გამრავლებით განახლება: *=

a=3
b=6
c=7
d=2
f=10
g=13
h=21
i=8
j=32
k=5

a+=4
b+=5
c+=12
d+=20
f+=30
g+=11
h+=32
i+=7
j+=8
k+=15

a-=3
b-=4
c-=6
d-=1
f-=5
g-=9
h-=11
i-=7
j-=20
k-=2

a/=1
b/=3
c/=7
d/=2
f/=5
g/=4
h/=7
i/=4
j/=4
k/=5

a*=3
b*=6
c*4
d*=10
f*=20
g*=2
h*=7
i*=5
j*=8
k*=1

a%=2
b%=4
c%3
d%=1.5
f%=6
g%=5
h%=8
i%=3
j%=5
k%=2

a**=3
b**=2
c**=2
d**=10
f**=2
g**=2
h**=2
i**=3
j**=1
k**=4

S=20
S+=30
S-=40
S*=10
S/=50
print(S)

#debbuging:
#1.პოვნა- იპოვე კოდი რაც არასწორად გიწერია
#2.მიზეზის გაგება -გაიგე თუ რა სჭირს კოდს
#3.გასწორება- გაასწორე კოდი
