celsius=20
fahrenheit=(20*9/5)+32

print(fahrenheit)

#მონაცემები პითონში 8 ნაწილად იყოფა
#1.text type-string. სტრინგი იგივეა რაც ტექსტური ინფორმაცია (თუ გინდა რომ სტრინგი შექმნა ბრჭყალებში ჩასვი რასაც დაწერ)
#2.numeric type- int,float,complex. ინთი არის მთელი რიცხვი. ფლოუთი არის რიცხვი როგორიცაა 3.2. 
#კომპლექსი კი არის ისეთი რიცხვი რაც არარსებობს, ესე შეგვიძლია გამოვთვალოთ ისეთი მაგალითი რაც ნორმალურ რიცხვებს არ შეუძლიათ
#3.sequence type-list,tuple,range. ლისთში მონაცემების შენახვა შეგიძლია. თიუფლიც იგივეა ოღონდ შეცვლა არ შეგეძლება
#რეინჯი ითვლის რიცხვებს სადამდეც მიუთითებ მაგალითად 1-100
#4.mapping type-dict. dict- key-ს ანიჭებს მნიშვნელობას (value)
#5 set types-set,frozenset. სეთი ინახავს ელემენტებს ფროუზენსეთიც იგივეა ოღონდ მისი შეცვლა არ შეგიძლია
#6.boolean type-bool. ბული წყვეტს არის თუ არა statement-ი true ან false ამით წყდება მოხდეს ბრძანება თუ არა
#7.binary types- bytes,bytearray,memory view. bytes გვიჩვენებს არის თუ არა statement true ან false ციფრებით
#bytearay იგივეა ოღონდ მისი კონტენტის შეცვლა შეგიძლია. memoryview-ით შეგვიძლია ობიექტის მეხსიერებაზე წვდომა მთლიანად დაკოპირების გარეშე
#8.none type-nonetyoe. nonetype აჩვენებს რომ ცვლადს ჯერ არ აქვს value.

# / არის გაყოფა 
#% არის ნაშთიანი გაყოფა
# განსხვავებაა ისაა რომ %-ს გამოგვაქვს რიცხვის ნაშთი. / არის ჩვეულებვრივი გაყოფა
#მაგ: 7%3=1 რადგან ნაშთი რჩება 1









